const test = require('ava').default;
const { moneyToThaiWord } = require('..');

test('Baht only', t => {
  const moneys = [
    { n: 0, w: 'ศูนย์บาทถ้วน' },
    { n: 7, w: 'เจ็ดบาทถ้วน' },
    { n: 23, w: 'ยี่สิบสามบาทถ้วน' },
    { n: 50, w: 'ห้าสิบบาทถ้วน' },
    { n: 100, w: 'หนึ่งร้อยบาทถ้วน' },
    { n: 311, w: 'สามร้อยสิบเอ็ดบาทถ้วน' },
    { n: 6543, w: 'หกพันห้าร้อยสี่สิบสามบาทถ้วน' },
    { n: 80808, w: 'แปดหมื่นแปดร้อยแปดบาทถ้วน' },
    { n: 414243, w: 'สี่แสนหนึ่งหมื่นสี่พันสองร้อยสี่สิบสามบาทถ้วน' },
    { n: 7531246, w: 'เจ็ดล้านห้าแสนสามหมื่นหนึ่งพันสองร้อยสี่สิบหกบาทถ้วน' },
    { n: 27531246, w: 'ยี่สิบเจ็ดล้านห้าแสนสามหมื่นหนึ่งพันสองร้อยสี่สิบหกบาทถ้วน' },
    { n: 527531246, w: 'ห้าร้อยยี่สิบเจ็ดล้านห้าแสนสามหมื่นหนึ่งพันสองร้อยสี่สิบหกบาทถ้วน' },
  ];
  moneys.forEach(m => {
    t.is(moneyToThaiWord(m.n), m.w);
  });
});

test('Baht without actual word (ถ้วน)', t => {
  const moneys = [
    { n: 0, w: 'ศูนย์บาท' },
    { n: 5, w: 'ห้าบาท' },
    { n: 66, w: 'หกสิบหกบาท' },
    { n: 123, w: 'หนึ่งร้อยยี่สิบสามบาท' },
    { n: 4215, w: 'สี่พันสองร้อยสิบห้าบาท' },
  ];
  moneys.forEach(m => {
    t.is(moneyToThaiWord(m.n, { showActual: false }), m.w);
  });
});


